In [2]:
import numpy as np
import pandas as pd

In [121]:
import os

In [123]:
os.getcwd()

'C:\\Users\\gaverzin\\pandas'

In [126]:
banks = pd.read_csv('banklist.xls')

In [127]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [128]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [130]:
# how many unique states represented here
# what are those states
banks['ST'].nunique()
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [150]:
# what are the states with the most failed banks
banks.groupby(by=['ST']).count().sort_values('Bank Name').tail()
banks.groupby(by=['ST']).count().sort_values('Bank Name',ascending=False).iloc[:5]

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
GA         93    93    93                     93            93            93
FL         75    75    75                     75            75            75
IL         67    67    67                     67            67            67
CA         41    41    41                     41            41            41
MN         23    23    23                     23            23            23

In [153]:
# how many banks has the State Bank of Texas actually acquired in Texas?
banks[banks['Acquiring Institution'] == 'State Bank of Texas']
#looks like only 1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [155]:
# How many banks don't have the name Bank in it?
sum(banks['Bank Name'].apply(lambda name: 'Bank' not in name))

14

In [158]:
#how many banks start with the letter 's'?
banks['Bank Name'].apply(lambda letter: letter[0].upper()== 'S').value_counts()

False    498
True      53
Name: Bank Name, dtype: int64

In [165]:
#how many banks closed in 2008?
banks['Closing Date'].apply(lambda date: date[-2:] == '08').value_counts()

False    526
True      25
Name: Closing Date, dtype: int64

In [170]:
# could also do
pd.to_datetime(banks['Closing Date']).apply(lambda date: date.year == 2008).value_counts()

False    526
True      25
Name: Closing Date, dtype: int64

In [3]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [4]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [5]:
from numpy.random import randn

In [6]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [7]:
df

             A         B
G1 1 -1.716734  0.179202
   2 -1.443069  2.103746
   3 -0.222515 -1.157419
G2 1 -0.388626 -1.350169
   2  0.582286  0.903779
   3  1.419988 -0.613790

In [17]:
#You can call specific areas, from outside to inside
df.loc['G1'].loc[1]

A   -1.716734
B    0.179202
Name: 1, dtype: float64

In [18]:
df.loc['G1'].loc[2]['A']

-1.4430691717862703

In [14]:
#you can also create indexes for the groups
df.index.names = ['Groups','Names']

In [15]:
df

                     A         B
Groups Names
G1     1     -1.716734  0.179202
       2     -1.443069  2.103746
       3     -0.222515 -1.157419
G2     1     -0.388626 -1.350169
       2      0.582286  0.903779
       3      1.419988 -0.613790

In [21]:
#these too codes are the same
df.loc['G1']
df.xs('G1')

              A         B
Names
1     -1.716734  0.179202
2     -1.443069  2.103746
3     -0.222515 -1.157419

In [23]:
#but what's nice is by using .xs, you can choose a cross-section
df.xs(1,level='Names')

               A         B
Groups
G1     -1.716734  0.179202
G2     -0.388626 -1.350169

In [25]:
#dealing with missing data
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [26]:
df = pd.DataFrame(d)

In [27]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [29]:
#using the drop na value
#but this is going to drop any row with a single missing value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [30]:
#for dropping missing columns 
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [31]:
##### THRESHOLDS ##########
#using thresholds, say equal to 2, it'll keep rows with at least 2 values 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [32]:
##### MISSING VALUES/REPLACEMENT #########
#to replace a missing value with a number, use fillna. method
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [34]:
#to get the mean of the columns
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [59]:
#to get a mean replacement for the 2nd row, you have to iterate through it
#first know that axis=1 is the mean for all rows
df.mean(axis=1)

0    2.333333
1    2.000000
2    3.000000
dtype: float64

In [49]:
m = df.mean(axis=1)
for i, col in enumerate(df):
             # using i allows for duplicate columns
             # inplace *may* not always work here, so IMO the next line is preferred
             # df.iloc[:, i].fillna(m, inplace=True)
             df.iloc[:, i] = df.iloc[:, i].fillna(m)

df.fillna(value=df['C'].mean())

In [61]:
m = df.mean(axis=1)
for i, col in enumerate(df):
    new_df = df.iloc[:, i].fillna(m)

In [64]:
new_df

0    1
1    2
2    3
Name: C, dtype: int64

In [60]:
#you could also use a transpose method to fill in means for all the rows
df.T.fillna(df.mean(axis=1)).T

     A    B    C
0  1.0  5.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  3.0

In [66]:
#### GROUP BY FUNCTIONS #########
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'], 
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [67]:
df = pd.DataFrame(data)

In [68]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
# Now group by company column, say because you want to get the mean of the sames
# first define it
byComp = df.groupby('Company')

In [70]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [73]:
byComp.mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [74]:
#some other useful information you can pull is
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [75]:
#### MERGING, JOINING & CONCATENATING ###########
## Concatenating is for combing dataframes with similar index dimensions
## Merging like contenating, but you can use keys (which may or may not be similar between dataframes)
## Joining is for combing dataframes with different indices
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [77]:
# to concatenate the dataframes together, they have to have the same dimensions along axis you wish to merge
# merge along the rows
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [78]:
# merge on the columns
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [82]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [83]:
pd.merge(left,right,how='inner',on=['key'])

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [85]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                    'key2': ['K0', 'K0', 'K0', 'K0'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [86]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [87]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [92]:
# a simple merge would work like
pd.merge(left,right)
#which is the same as an inner join

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [89]:
## merge these on the row keys (so no need to define axis=1)
#left table will be the base template
pd.merge(left,right,how='left', on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [90]:
pd.merge(left,right,how='inner', on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [91]:
# right table is base template
pd.merge(left,right,how='right', on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [93]:
## JOINS
## use joins for combining dataframes with different indexes
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

In [94]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [95]:
######## OPERATIONS ##############
## Pivot tables
## how to count how many unique values you have
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [96]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [98]:
# get unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [99]:
# get unique number of values
df['col2'].nunique()

3

In [100]:
# get a table of unique values in your table
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [101]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [102]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [103]:
#say you have a function and want to broadcast that to your dataset
def times2(x):
    return x*2

In [105]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [107]:
# remember to use you lambda expression too, much easier
## THIS IS SUPER IMPORTANT AND USEFUL
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [108]:
## DROPPING A COLUMN
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [111]:
#drop a column
df.drop('col3',axis=1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [113]:
#drop a row
df.drop(0,axis=0)

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [114]:
### SORTING VALUES
## you can do it by any column
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [115]:
## FINDING NULL VALUES
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [116]:
## PIVOT TABLES
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

In [117]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [118]:
df =pd.DataFrame(data)

In [119]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [120]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN